---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFromProjectAndLink
source: html/50b22d65-1646-6a38-03cc-00880a95d724.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFromProjectAndLink Property

Can't Copy to Clipboard elements from the project and a link instance at the same time. Only elements from the project will be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyFromProjectAndLink { get; }
```